Repository: mdhcindioglu/GuessNumber
Catalog: GuessNumber/GuessNumber/GuessNumber/Resources/AppResources.*.resx
Languages: ar, tr

# AppTitle
source: Guess Number
ar: خمّن الرقم
tr: Rakam tahmin et

# BackToMain
source: Back to main screen
ar: عودة للصفحة الرئيسية
tr: Ana menü

# ChoiceNumber
source: Choice number length 4
ar: إختر رقم من اربع خانات
tr: 4 haneli rakam seç

source: D
ar: ت
tr: Y

source: Del
ar: حذف
tr: Sil

source: Mobile
ar: الجوال
tr: Mobil

source: Ok
ar: موافق
tr: Tamam

# Roles
source: The roles
ar: قواعد اللعبة
tr: Kurallar

# RolesDetails
source: <P style = "text-size = 20"> <strong> Introduction: </strong> </P> <p> The game depends on you, mobile and players. First you have to choose a four-digit number without repeating any 5684, 1657 or 9641. Then one player starts playing and the first player is randomly selected. </p> <p> If the phone starts playing, it will select a four-digit number and display it on the screen in the cell field, then display the result of its comparison with your number you chose in the first stage, and the result will be as follows: </p> <P style = "text-size = 20"> <strong> Results: </strong> </P> <p> 1- If there is one of the four digits that contain one of the four numbers you have chosen and was in the same place, the letter (i), meaning a match, will appear. </p> <p> 2- If there is one of the four cells containing one of the four numbers you chose, but somewhere else, the letter “T” will appear, that is, exchange. </p> <p> 3- If there is no match or exchange in any of the four digits, a sign (-) appears. </p> <p> The role is transferred to the second player, so if you are, you have to guess a four-digit number that is not repeated, then click the OK button, the number will appear in your field and next to it the result: i or i or o ... <p> This is how the process is repeated until one of you guesses the other party's number, and so is the winner. </p> <P style = "text-size = 20"> <strong> Analysis: </strong> </P> <p> The game depends on analysis and comparison, for example when entering the number 7896 and the appearance of the result (-), this means that the number of the other party does not contain 7896, and therefore it is a mistake to re-enter these numbers except in case of confirmation of another number. </p> <p> For example ... if the result of a number like 1234 is T, that is, two exchanges, then this means that two of the four numbers are correct, but their locations are incorrect. </p> <p> If the result of a number like 9056 is T i, i.e. exchange and congruence, then this means that two of the four numbers are correct, but one is in its place and the other is in a place other than its location. </p> <p> And so on until you guess the correct number. </p> <p style = "text-size = 20"> <strong> I hope you spend useful and enjoyable times with this app. Do not skimp on us by evaluating the application on the Google Play Market. </strong> </p>
ar: <P style="text-size=20"> <strong>مقدمة:</strong> </P> <p>تعتمد اللعبة على لاعبين ، أنت والجوال. بداية عليك إختيار رقم مكون من أربع خانات بدون تكرار أي 5684 أو 1657 أو 9641. ثم يبدأ اللعب أحد اللاعبين ويتم تحديد اللاعب الأول بشكل عشوائي.</p> <p>في حال بدأ الجوال باللعب فسيحدد رقم مكون من أربع خانات ويعرضه على الشاشة في خانت الجوال, ثم يعرض نتيجة مقارنته مع رقمك الذي اخترته في أول مرحلة، وتكون النتيجة كما يلي:</p> <P style="text-size=20"> <strong>النتائج:</strong> </P> <p>1- في حال وجود خانة من الأربع خانات تحوي رقم من ضمن الأرقام الأربعة التي اخترتها وكان في نفس المكان فسيظهر حرف (ط) أي تطابق.</p> <p>2- في حال وجود خانة من الأربع خانات تحوي رقم من ضمن الأرقام الأربعة التي اخترتها ولكن في مكان آخر فسيظهر حرف (ت) أي تبادل.</p> <p>3- في حال عدم وجود تطابق أو تبادل في أي خانة من الأربع خانات فسيظهر (-).</p> <p>وبهذا ينتقل الدور للاعب الثاني فإن كنت أنت فعليك تخمين رقم من أربع خانات وغير مكرر ثم نقر زر موافق، سيظهر الرقم في خانتك وبجانبه النتيجة: ط ط أو ط ت أو -...</p> <p>وهكذا تتكرر العملية حتى يخمن أحدكما رقم الطرف الآخر وبذلك يكون هو الرابح.</p> <P style="text-size=20"> <strong>التحليل:</strong> </P> <p>تعتمد اللعبة على التحليل والمقارنة فمثلا عند إدخال رقم 7896 وظهور النتيجة (-) فهذا يعني أن رقم الطرف الآخر لا يحوي 7896 , وعليه فمن الخطأ إعادة إدخال هذه الأرقام إلا في حالة التأكد من رقم آخر.</p> <p>فمثلا ... في حال كانت نتيجة رقم مثل 1234 هو ت ت أي تبادلين فهذا يعني أن إثنين من الأرقام الأربعة صحيحة ولكن أماكنها غير صحيحة.</p> <p>وإذا كانت نتيجة رقم مثل9056 هو ت ط أي تبادل وتطابق فهذا يعني أن إثنين من الأرقام الأربعة صحيحة ولكن أحدهما في مكانه والآخر في مكان غير مكانه.</p> <p>وهكذا حتى تخمن الرقم الصحيح.</p> <p style="text-size=20"> <strong>أتمنى لكم قضاء أوقات مفيدة وممتعة مع هذا التطبيق. ولا تبخلوا علينا بتقييم التطبيق على سوق غوغل بلاي.</strong> </p>
tr: <P style = "font-size= 20"> <strong> Giriş: </strong> </ P> <p> Oyun size, mobil ve oyunculara bağlıdır. Her şeyden önce, herhangi bir 5684, 1657 veya 9641'i tekrarlamadan dört basamaklı bir sayı seçmelisiniz. Sonra bir oyuncu oynamaya başlar ve ilk oyuncu rastgele seçilir. </p> <p> Telefon çalmaya başlarsa, dört basamaklı bir sayı seçer ve hücre alanında ekranda görüntüler, ardından ilk aşamada seçtiğiniz numaranızla karşılaştırmasının sonucunu görüntüler ve sonuç aşağıdaki gibi olur: </p> <P style = "font-size= 20"> <strong> Sonuçlar: </strong> </ P> <p> 1- Seçtiğiniz ve aynı yerde bulunan dört rakamdan birini içeren dört basamaktan biri varsa, eşleşme anlamına gelen (i) harfi görünecektir. </p> <p> 2- Seçtiğiniz dört sayıdan birini içeren dört hücreden biri varsa, ancak başka bir yerde, “T” harfi görünür, yani değiş tokuş. </p> <p> 3- Dört basamaktan herhangi birinde bir eşleşme veya değişim olmadığında, bir işaret (-) görünür. </p> <p> Rol ikinci oyuncuya aktarılır, bu yüzden tekrarlanırsanız dört basamaklı bir sayı tahmin etmeniz ve ardından Tamam düğmesini tıklamanız gerekir, sayı alanınızda ve sonucun yanında görünür: i veya i veya o ... <p> Biriniz karşı tarafın numarasını tahmin edene kadar kazanan bu şekilde tekrarlanır. </p> <P style = "font-size= 20"> <strong> Analiz: </strong> </ P> <p> Oyun, analiz ve karşılaştırmaya dayanıyor, örneğin, 7896 sayısını ve sonucun görünümünü (-) girerken, diğer tarafın numarası 7896 içermediğinden, başka bir numarayı onaylamadığınız sürece bu sayıları tekrar girmek yanlış demektir. </p> <p> Örneğin ... 1234 gibi bir sayının sonucu T ise, yani iki borsa ise, bu dört sayıdan ikisinin doğru olduğu, ancak konumlarının yanlış olduğu anlamına gelir. </p> <p> 9056 gibi bir sayının sonucu T i, yani değiş tokuş ve uyuşma ise, bu dört sayıdan ikisinin doğru olduğu, ancak birinin yerinde olduğu ve diğerinin bulunduğu yerden başka bir yerde olduğu anlamına gelir. </p> <p> Doğru sayıyı tahmin edene kadar devam edin. </p> <P style = "font-size= 20"> <strong> Umarım bu uygulama ile faydalı ve keyifli zamanlar geçirirsiniz. Google Play Market'teki uygulamayı değerlendirerek bizi gözden kaçırmayın. </strong> </ P>

source: S
ar: ط
tr: A

# StartGame
source: Start new game
ar: ابدأ لعبة جديدة
tr: Yeni oyun

source: you
ar: أنت
tr: sen

# YouLost
source: Sorry, you lost.
ar: آسف، لقد خسرت هذه الجولة.
tr: üzgünüm, kaybetin.

# YourTurn
source: Its your turn
ar: دورك الآن
tr: Senin sıran

# YouWon
source: Congratulation! you WON!!!
ar: مبروك! لقد ربحت هذه الجولة!
tr: Tebrekler! Kazandın.
